2024-4-19/3e54284ca4-IDEA.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-05-22 Wed 16:46 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>switcher logic</title>
<meta name="author" content="Yang" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../css/readtheorg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">switcher logic</h1>
<ol class="org-ol">
<li>本地通过http协议发送(https之后再看)：
请求路径/switcher/
local_ip=192.168.xxx.xxx
status=online/offline
version=1</li>
</ol>
<p>
服务器需要返回ACK,并且这个route需要1min一次。
服务器记录request_ip, local_ip,,status三个数据。
</p>
<ol class="org-ol">
<li>用户向服务器发起http请求，服务器进行功能展示，通过重定向功能，经由用户向esp32发送命令，
再由esp32操作之后重定向会服务器，将操作结果返回。</li>
</ol>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">def</span> <span style="font-weight: bold;">remote_server_closed</span>():
    <span style="font-weight: bold;">pass</span>
<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">http_get</span>(url):
    <span style="font-weight: bold;">import</span> socket
    <span style="font-weight: bold; font-style: italic;">_</span>, <span style="font-weight: bold; font-style: italic;">_</span>, <span style="font-weight: bold; font-style: italic;">host</span>, <span style="font-weight: bold; font-style: italic;">path</span> = url.split(<span style="font-style: italic;">'/'</span>, 3)
    <span style="font-weight: bold; font-style: italic;">addr</span> = socket.getaddrinfo(host, 80)[0][-1]
    <span style="font-weight: bold; font-style: italic;">s</span> = socket.socket()
    <span style="font-weight: bold;">try</span>:
        s.connect(addr)
    <span style="font-weight: bold;">except</span> <span style="font-weight: bold; text-decoration: underline;">OSError</span>:
        <span style="font-weight: bold;">print</span>(<span style="font-style: italic;">'connects remote server failed.'</span>)
        remote_server_closed()
        <span style="font-weight: bold;">return</span>
    s.send(<span style="font-weight: bold;">bytes</span>(<span style="font-style: italic;">'GET /%s HTTP/1.0</span><span style="font-weight: bold; text-decoration: underline;">\r\n</span><span style="font-style: italic;">Host: %s</span><span style="font-weight: bold; text-decoration: underline;">\r\n\r\n</span><span style="font-style: italic;">'</span> % (path, host), <span style="font-style: italic;">'utf8'</span>))
    <span style="font-weight: bold;">while</span> <span style="font-weight: bold; text-decoration: underline;">True</span>:
        <span style="font-weight: bold; font-style: italic;">data</span> = s.recv(100)
        <span style="font-weight: bold;">if</span> data:
            <span style="font-weight: bold;">print</span>(<span style="font-weight: bold;">str</span>(data, <span style="font-style: italic;">'utf8'</span>), end=<span style="font-style: italic;">''</span>)
        <span style="font-weight: bold;">else</span>:
            <span style="font-weight: bold;">break</span>
    s.close()

<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">get_local_ip</span>():
    <span style="font-style: italic;">'caller needs to ensure network is fine.'</span>
    <span style="font-weight: bold;">import</span> network
    <span style="font-weight: bold;">return</span> network.WLAN(network.STA_IF).ifconfig()[0]

<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">isConnected</span>():
    <span style="font-weight: bold;">import</span> network
    <span style="font-weight: bold;">return</span> network.WLAN(network.STA_IF).isconnected()

<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">local_wifi_no_connected</span>():
    <span style="font-weight: bold;">print</span>(<span style="font-style: italic;">'local_wifi_no_connected'</span>)

<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">callback</span>(t):
    <span style="font-weight: bold;">if</span> <span style="font-weight: bold;">not</span> isConnected():
        <span style="font-weight: bold;">return</span> 0
    <span style="font-weight: bold; font-style: italic;">local_ip</span> = get_local_ip()
    <span style="font-weight: bold; font-style: italic;">status</span> = <span style="font-style: italic;">'online'</span>
    <span style="font-weight: bold; font-style: italic;">version</span> = <span style="font-style: italic;">'1'</span>
    http_get(f<span style="font-style: italic;">'http://124.222.214.132/esp32c3?</span>{local_ip=}<span style="font-style: italic;">&amp;</span>{status=}<span style="font-style: italic;">&amp;</span>{version=}<span style="font-style: italic;">'</span>)

<span style="font-weight: bold;">from</span> machine <span style="font-weight: bold;">import</span> Timer
<span style="font-weight: bold; font-style: italic;">timer</span> = Timer(0,
              mode=Timer.PERIODIC,
              period=1000*5,
              callback=callback)

</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">import</span> socket, network

<span style="font-weight: bold; font-style: italic;">CONTENT</span> = b<span style="font-style: italic;">"""\</span>
<span style="font-style: italic;">HTTP/1.0 302 Found</span>

<span style="font-style: italic;">Location: http://124.222.214.132/</span>
<span style="font-style: italic;">"""</span>

<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">main</span>(micropython_optimize=<span style="font-weight: bold; text-decoration: underline;">False</span>):
    <span style="font-weight: bold; font-style: italic;">s</span> = socket.socket()

    <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Binding to all interfaces - server will be accessible to other hosts!</span>
    <span style="font-weight: bold; font-style: italic;">ai</span> = socket.getaddrinfo(<span style="font-style: italic;">"0.0.0.0"</span>, 80)
    <span style="font-weight: bold;">print</span>(<span style="font-style: italic;">"Bind address info:"</span>, ai)
    <span style="font-weight: bold; font-style: italic;">addr</span> = ai[0][-1]

    s.setsockopt(socket.SOL_SOCKET, socket.SO_REUSEADDR, 1)
    s.bind(addr)
    s.listen(5)
    <span style="font-weight: bold;">print</span>(<span style="font-style: italic;">"Listening, connect your browser to http://%s:80/"</span> %
          network.WLAN(network.STA_IF).ifconfig()[0])

    <span style="font-weight: bold;">while</span> <span style="font-weight: bold; text-decoration: underline;">True</span>:
        <span style="font-weight: bold; font-style: italic;">res</span> = s.accept()
        <span style="font-weight: bold; font-style: italic;">client_sock</span> = res[0]
        <span style="font-weight: bold; font-style: italic;">client_addr</span> = res[1]
        <span style="font-weight: bold;">print</span>(<span style="font-style: italic;">"Client address:"</span>, client_addr)
        <span style="font-weight: bold;">print</span>(<span style="font-style: italic;">"Client socket:"</span>, client_sock)

        <span style="font-weight: bold;">if</span> <span style="font-weight: bold;">not</span> micropython_optimize:
            <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">To read line-oriented protocol (like HTTP) from a socket (and</span>
            <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">avoid short read problem), it must be wrapped in a stream (aka</span>
            <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">file-like) object. That's how you do it in CPython:</span>
            <span style="font-weight: bold; font-style: italic;">client_stream</span> = client_sock.makefile(<span style="font-style: italic;">"rwb"</span>)
        <span style="font-weight: bold;">else</span>:
            <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">.. but MicroPython socket objects support stream interface</span>
            <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">directly, so calling .makefile() method is not required. If</span>
            <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">you develop application which will run only on MicroPython,</span>
            <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">especially on a resource-constrained embedded device, you</span>
            <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">may take this shortcut to save resources.</span>
            <span style="font-weight: bold; font-style: italic;">client_stream</span> = client_sock

        <span style="font-weight: bold;">print</span>(<span style="font-style: italic;">"Request:"</span>)
        <span style="font-weight: bold; font-style: italic;">req</span> = client_stream.readline()
        <span style="font-weight: bold;">print</span>(req)
        <span style="font-weight: bold;">while</span> <span style="font-weight: bold; text-decoration: underline;">True</span>:
            <span style="font-weight: bold; font-style: italic;">h</span> = client_stream.readline()
            <span style="font-weight: bold;">if</span> h == b<span style="font-style: italic;">""</span> <span style="font-weight: bold;">or</span> h == b<span style="font-style: italic;">"</span><span style="font-weight: bold; text-decoration: underline;">\r\n</span><span style="font-style: italic;">"</span>:
                <span style="font-weight: bold;">break</span>
            <span style="font-weight: bold;">print</span>(h)
        client_stream.write(CONTENT)

        client_stream.close()
        <span style="font-weight: bold;">if</span> <span style="font-weight: bold;">not</span> micropython_optimize:
            client_sock.close()
        <span style="font-weight: bold;">print</span>()


main()
</pre>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Yang</p>
<p class="date">Created: 2024-05-22 Wed 16:46</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
